6.170SoftwareStudio/projectwo-contents/app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops"
---
    def index
        # Returns a simple HTML page listing all available shops
        @shops = Shop.all
        unless @shops.blank?

SELECT "shops".* FROM "shops" WHERE "shops"."identifier" = '001' LIMIT 1
---
    def show
        #New function that loads a specific site, returns not found if not found
        shop_id = params[:id]

        @shop = Shop.find_by(identifier: shop_id)

INSERT INTO "shops" ("name", "location", "created_at", "updated_at", "identifier") VALUES (NULL, NULL, '2025-05-13 20:32:34.347425', '2025-05-13 20:32:34.347425', '001') RETURNING "id"
SELECT "shops".* FROM "shops" WHERE "shops"."identifier" = '001' LIMIT 1
---
    def create
        #Create function posts out specific site and registers new visit
        shop_id = params[:id]

        @shop = Shop.find_or_create_by(identifier: shop_id) do |site|